#include "quicklib.h"
#include <EEPROM.h>

#define EZO_MAX_PROBES 12
#define EZO_MAX_VALUES 3        // 3 for full HUM / 5 for full RGB...
#define EZO_1st_ADDRESS 32
#define EZO_LAST_ADDRESS 127

// EEprom
//  4x settings 151 Bytes = 602
// 12x ezoProbe  22 Bytes = 264     - 866 (133)
//  3x manual    41 Bytes = 123     - 989 (10)
// 12 Byte "MY"

// What is the actual Action
// 0 = all read
// 1 = write command(s)
// 2 = all written
// 3 = read answer(s)
static byte ezoAction = 0;

// Which is the actual ezo
static byte ezoAct = 0;

// How many ezo's we have
static byte ezoCnt = 0;

#define ezoRTD 0
#define ezoHUM 1    // Hardware has Temp & DEW, too !
#define ezoCO2 2
#define ezoTMP 3    // No real Hardware - Temp from HUM
#define ezoDEW 4    // No real Hardware - Dew from HUM

const char ezoStrType_0[] PROGMEM = "RTD";
const char ezoStrType_1[] PROGMEM = "HUM";
const char ezoStrType_2[] PROGMEM = "CO2";
const char ezoStrType_3[] PROGMEM = "DEW";
PGM_P const ezoStrType[] PROGMEM = {
    ezoStrType_0,
    ezoStrType_1,
    ezoStrType_2,
    ezoStrType_3
};


// RTD
const char ezoStrTimeType_1[] PROGMEM = "Exhaust";
const char ezoStrTimeType_2[] PROGMEM = "Intake";
const char ezoStrTimeType_3[] PROGMEM = "Circ.";
// Hum
// CO2
// DEW
PGM_P const ezoStrTimeType[] PROGMEM = {
    ezoStrType_0,
    ezoStrTimeType_1,
    ezoStrTimeType_2,
    ezoStrTimeType_3,
    ezoStrType_1,
    ezoStrType_2,
    ezoStrType_3,
};


const char ezoStrUnit_0[] PROGMEM = "째C";
const char ezoStrUnit_1[] PROGMEM = "rH%";
const char ezoStrUnit_2[] PROGMEM = "ppm";
// 째C
// 째C
PGM_P const ezoStrUnit[] PROGMEM = {
    ezoStrUnit_0,
    ezoStrUnit_1,
    ezoStrUnit_2,
    ezoStrUnit_0,
    ezoStrUnit_0,
};

// Waittime for readings...
const int ezoWait[] PROGMEM = {600, 900, 900}; // !! check the 900s !!

// Count of vals of probe
const byte ezoValCnt[] PROGMEM = {1, 3, 2};

// if type has a calibration
const byte ezoHasCal[] PROGMEM = {1, 0, 1};

typedef struct ezoProbeSTRUCT{
    // 22 Byte * ??? Probes Max = ??? Byte
    byte type;
    byte calibrated;
    //byte error;            // 0=OK, 1=processing, 2=syntax, 3=IIC, unknown
    byte address;
    uint16_t version; 
    char name[17];
    //long valueLast[EZO_MAX_VALUES];
}ezoProbeSTRUCT;
ezoProbeSTRUCT ezoProbe[EZO_MAX_PROBES];

int32_t ezoValue[EZO_MAX_PROBES][EZO_MAX_VALUES];

struct settingSTRUCT{
    // 151 Byte x 2 (day & night) 301 Byte
    uint16_t DelayTime[7];      // 14      // Temp / Exhaust / Intake / Circulation / Humidity / CO2 / Dew (heat on Wet)
    uint16_t TimeTooLow[7];     // 14
    uint16_t TimeLow[7];        // 14
    uint16_t TimeHigh[5];       // 10
    uint16_t TimeTooHigh[5];    // 10
    int32_t FailSaveValue[4];   // 16   // Temp / Hum / CO2 / DEW / 
    int32_t ValueTooLow[4];     // 16   // Temp / Hum / CO2 / Dew
    int32_t ValueLow[4];        // 16
    int32_t ValueHigh[2];       // 08
    int32_t ValueTooHigh[2];    // 08
    char Name[17];              // 17
    //                            143
}setting;

struct manualSTRUCT{
    // 41 Bytes x doesn't matter
    // m) SomeBlaBlaName     |     Low    |     High   |   Value    |
    //---------------------------------------------------------------
    //          RTD          | a)[0+2]    | h)[4]      |
    //- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    //         Exhaust       | b)         |            | i)         |
    //         Intake        | c)         |            | j)         |
    //         Circ.         | d)         |            | k)         |
    //---------------------------------------------------------------
    //          HUM          | e)[1]      | l)[5]      |
    //--------------------------------------------------
    //          CO2          | f)[2]      | 
    //-------------------------------------
    //          DEW          | g)[3]      |
    uint16_t LowPort[7];    // 14            // Heat / Exh. / Intake / Circ. / Hum / Add(CO2) / Heat(DEW)
    uint16_t HighPort[5];   // 10            // Cool / Val  /   Val  /  Val  / Dry 
    char Name[17];          // 17
    //                      // 41
}manual;

// Counter for Low/High
uint32_t tooLowSince[7];
uint32_t lowSince[7];
uint32_t okSince[7];
uint32_t highSince[2];
uint32_t tooHighSince[2];
// Time of last action 
uint32_t lastAction[7];

long avgVal[5]; //  = {21000L, 1250000L, 6000L, 225000L, 99999L, 66666L};
#define avg_RTD avgVal[0]
#define avg_HUM avgVal[1]
#define avg_CO2 avgVal[2]
#define avg_TMP avgVal[3]
#define avg_DEW avgVal[4]


#define CAL_RTD_RES -1         // Value for Reset
#define CAL_RTD_LOW 0          // Value for LowPoint
#define CAL_RTD_MID 21000      // Value for MidPoint
#define CAL_RTD_HIGH 100000    // Value for HighPoint

#define CAL_CO2_RES -1         // Value for Reset
#define CAL_CO2_LOW 0          // Value for LowPoint
#define CAL_CO2_MID 3900000    // Value for MidPoint
#define CAL_CO2_HIGH 0         // Value for HighPoint


void DefaultProbesToRom(){
    // Save actual probe-constellation as Standard to Eeprom
